test/fixtures/stripe/customer.subscription.created.json

{
  "id": "evt_1PpJ5q2eZvKYlo2C0a1a2b3c",
  "object": "event",
  "api_version": "2025-05-28.basil",
  "created": 1646784000,
  "data": {
    "object": {
      "id": "sub_1PpJ5q2eZvKYlo2C0a1a2b3c",
      "object": "subscription",
      "application_fee_percent": null,
      "billing_cycle_anchor": 1646784000,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1646784000,
      "current_period_end": 1649376000,
      "current_period_start": 1646784000,
      "customer": "cus_P123456789",
      "days_until_due": null,
      "default_payment_method": "pm_1PpJ5q2eZvKYlo2C0a1a2b3c",
      "default_source": null,
      "default_tax_rates": [],
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_P123456789",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1646784000,
            "metadata": {},
            "price": {
              "id": "price_123456789",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1646697600,
              "currency": "usd",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "product": "prod_P123456789",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 999,
              "unit_amount_decimal": "999"
            },
            "quantity": 1,
            "subscription": "sub_1PpJ5q2eZvKYlo2C0a1a2b3c",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "url": "/v1/subscription_items?subscription=sub_1PpJ5q2eZvKYlo2C0a1a2b3c"
      },
      "latest_invoice": "in_1PpJ5q2eZvKYlo2C0a1a2b3c",
      "livemode": false,
      "metadata": {
        "user_id": "user_123"
      },
      "next_pending_invoice_item_invoice": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "off"
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "schedule": null,
      "start_date": 1646784000,
      "status": "active",
      "test_clock": null,
      "transfer_data": null,
      "trial_end": null,
      "trial_start": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_123456789",
    "idempotency_key": "123456789"
  },
  "type": "customer.subscription.created"
}
